# ██████╗ ██████╗ ███████╗██╗    ██╗███████╗██╗██╗     ███████╗
# ██╔══██╗██╔══██╗██╔════╝██║    ██║██╔════╝██║██║     ██╔════╝
# ██████╔╝██████╔╝█████╗  ██║ █╗ ██║█████╗  ██║██║     █████╗
# ██╔══██╗██╔══██╗██╔══╝  ██║███╗██║██╔══╝  ██║██║     ██╔══╝
# ██████╔╝██║  ██║███████╗╚███╔███╔╝██║     ██║███████╗███████╗
# ╚═════╝ ╚═╝  ╚═╝╚══════╝ ╚══╝╚══╝ ╚═╝     ╚═╝╚══════╝╚══════╝

cask_args appdir: "/Applications"

# =================================================
# Taps
# =================================================

tap "homebrew/bundle"
tap "homebrew/services"

# =================================================
# Fonts
# =================================================

cask "font-jetbrains-mono"
cask "font-hack-nerd-font"

# =================================================
# Apps
# =================================================

cask "brave-browser"
cask "clickup"
cask "discord"
cask "docker"
cask "kitty"
cask "malwarebytes"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "mullvadvpn"
cask "obs"
cask "obsidian"
cask "ollama"
cask "spotify"
cask "telegram"
cask "warp"
cask "zed"
cask "zen-browser"
cask "zoom"

# =================================================
# App Store Apps
# =================================================

mas "Bitwarden", id: 1352778147
mas "Slack", id: 803453959

# =================================================
# Packages
# =================================================

# Cloud/DevOps

brew "awscli"
brew "eksctl"
brew "gitleaks"
brew "helm"
brew "k9s"
brew "krew"
brew "kubectx"
brew "kubernetes-cli"
brew "podman"
brew "sops"
brew "terraform"
brew "terraform-docs"
brew "tflint"

# Programming

brew "go"
brew "goreleaser"
brew "nvm"
brew "openjdk"
brew "rust"
brew "rustup"

# Shell

brew "bash"
brew "gum"
brew "neofetch"
brew "neovim"
brew "starship"
brew "tmux"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Network

brew "curl"
brew "dnscrypt-proxy"
brew "nmap"
brew "telnet"
brew "wget"

# Utilities

brew "awk"
brew "cowsay"
brew "direnv"
brew "fzf"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "git-lfs"
brew "gh"
brew "gnupg"
brew "gpg"
brew "htop"
brew "jq"
brew "mas"
brew "mercurial"
brew "ollama"
brew "stow"
brew "rclone"
brew "tree"
brew "unzip"
brew "pre-commit"
brew "pinentry"
brew "watch"
brew "yq"
