# ██████╗ ██████╗ ███████╗██╗    ██╗███████╗██╗██╗     ███████╗
# ██╔══██╗██╔══██╗██╔════╝██║    ██║██╔════╝██║██║     ██╔════╝
# ██████╔╝██████╔╝█████╗  ██║ █╗ ██║█████╗  ██║██║     █████╗
# ██╔══██╗██╔══██╗██╔══╝  ██║███╗██║██╔══╝  ██║██║     ██╔══╝
# ██████╔╝██║  ██║███████╗╚███╔███╔╝██║     ██║███████╗███████╗
# ╚═════╝ ╚═╝  ╚═╝╚══════╝ ╚══╝╚══╝ ╚═╝     ╚═╝╚══════╝╚══════╝

cask_args appdir: "/Applications"

# =================================================
# TAPS
# =================================================
tap "homebrew/bundle"
tap "homebrew/services"

# =================================================
# FONTS
# =================================================
cask "font-jetbrains-mono"
cask "font-hack-nerd-font"

# =================================================
# APPS
# =================================================

# -------------------
# Browsers
# -------------------
cask "brave-browser"
cask "tor-browser"
cask "zen-browser"

# -------------------
# Development
# -------------------
cask "cursor"
cask "datagrip"
cask "docker"
cask "google-cloud-sdk"
cask "kitty"
cask "lens"
cask "obsidian"
cask "ollama"
cask "session-manager-plugin"
cask "warp"
cask "zed"
cask "windsurf"

# -------------------
# Communication
# -------------------
cask "discord"
cask "microsoft-teams"
cask "telegram"
cask "zoom"
cask "whatsapp"

# -------------------
# Security & Privacy
# -------------------
cask "bitwarden"
cask "burp-suite"
cask "malwarebytes"
cask "mullvadvpn"

# -------------------
# Productivity
# -------------------
cask "appcleaner"
cask "clickup"
cask "coconutbattery"
cask "obs"

# -------------------
# Utilities
# -------------------
cask "microsoft-auto-update"
cask "spotify"
cask "webtorrent"

# =================================================
# APP STORE APPS
# =================================================
mas "Slack", id: 803453959

# =================================================
# PACKAGES
# =================================================

# -------------------
# AI
# -------------------
brew "aichat"
brew "gptme"
brew "ollama"

# -------------------
# Cloud & DevOps
# -------------------
brew "awscli"
brew "chart-testing"
brew "eksctl"
brew "helm"
brew "k9s"
brew "kind"
brew "krew"
brew "kubecm"
brew "kubectx"
brew "kubernetes-cli"
brew "leapp"
brew "opentofu"
brew "teller"
brew "terraform"
brew "terraform-docs"
brew "tflint"
brew "sops"

# -------------------
# Containers
# -------------------
brew "docker"
brew "lazydocker"
brew "podman"

# -------------------
# Development Tools
# -------------------
brew "direnv"
brew "go-task"
brew "golangci-lint"
brew "pre-commit"
brew "nvm"
brew "pyenv"
brew "rbenv"
brew "rustup"
brew "volta"

# -------------------
# Programming Languages
# -------------------
brew "go"
brew "node"
brew "openjdk"
brew "python"
brew "rust"

# -------------------
# Package Managers
# -------------------
brew "pnpm"

# -------------------
# Shell & CLI
# -------------------
brew "argc"
brew "atuin"
brew "fzf"
brew "gum"
brew "neovim"
brew "nushell"
brew "starship"
brew "tmux"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# -------------------
# Security
# -------------------
brew "age"
brew "bitwarden-cli"
brew "git-crypt"
brew "gitleaks"
brew "gnupg"
brew "gpg"
brew "sops"

# -------------------
# Code Quality
# -------------------
brew "hadolint"
brew "shellcheck"
brew "yamllint"

# -------------------
# Networking
# -------------------
brew "curl"
brew "dnscrypt-proxy"
brew "nmap"
brew "telnet"
brew "wget"

# -------------------
# System Monitoring
# -------------------
brew "btop"
brew "fastfetch"
brew "htop"
brew "neofetch"

# -------------------
# Text & File Utilities
# -------------------
brew "awk"
brew "bat"
brew "eza"
brew "fd"
brew "jq"
brew "pandoc"
brew "p7zip"
brew "tree"
brew "unzip"
brew "yazi"
brew "yq"

# -------------------
# Git Tools
# -------------------
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "github-keygen"
brew "lazygit"

# -------------------
# Miscellaneous
# -------------------
brew "chezmoi"
brew "cmake"
brew "coreutils"
brew "cowsay"
brew "findutils"
brew "m-cli"
brew "mas"
brew "mercurial"
brew "monolith"
brew "pinentry"
brew "rclone"
brew "spacer"
brew "stow"
brew "texlab"
brew "watch"
brew "ffmpegthumbnailer"
brew "ffmpeg"
brew "sevenzip"
brew "poppler"
brew "ripgrep"
brew "zoxide"
brew "imagemagick"

# -------------------
# Email
# -------------------
brew "isync"
brew "msmtp"
brew "mu"
