# ██████╗ ██████╗ ███████╗██╗    ██╗███████╗██╗██╗     ███████╗
# ██╔══██╗██╔══██╗██╔════╝██║    ██║██╔════╝██║██║     ██╔════╝
# ██████╔╝██████╔╝█████╗  ██║ █╗ ██║█████╗  ██║██║     █████╗
# ██╔══██╗██╔══██╗██╔══╝  ██║███╗██║██╔══╝  ██║██║     ██╔══╝
# ██████╔╝██║  ██║███████╗╚███╔███╔╝██║     ██║███████╗███████╗
# ╚═════╝ ╚═╝  ╚═╝╚══════╝ ╚══╝╚══╝ ╚═╝     ╚═╝╚══════╝╚══════╝

cask_args appdir: "/Applications"

# =================================================
# Taps
# =================================================

tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"

# =================================================
# Fonts
# =================================================

cask "font-jetbrains-mono"
cask "font-hack-nerd-font"

# =================================================
# Apps
# =================================================

cask "brave-browser"
cask "discord"
cask "mullvadvpn"
cask "obs"
cask "obsidian"
cask "ollama"
cask "spotify"
cask "telegram"
cask "zed"
cask "zen-browser"
cask "warp"
cask "microsoft-teams"
cask "zoom"

# =================================================
# App Store Apps
# =================================================

mas "Slack", id: 803453959
mas "WhatsApp Desktop", id: 1147396723
mas "Bitwarden", id: 1352778147

# =================================================
# Packages
# =================================================

# Utilities

brew "mas"
brew "curl"
brew "direnv"
brew "dnscrypt-proxy"
brew "fzf"
brew "git"
brew "git-lfs"
brew "jq"
brew "tree"
brew "wget"
brew "htop"
brew "nmap"
brew "tree"
brew "awk"

# Shell

brew "bash"
brew "neovim"
brew "starship"
brew "tmux"
brew "zsh"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Programming

brew "go"
brew "goreleaser"
brew "nvm"

# Cloud/DevOps

brew "awscli"
brew "gitleaks"
brew "krew"
brew "kubernetes-cli"
brew "podman"
brew "k9s"
